<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en"><head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">

	<meta name="author" content="Lukas&scaron Jakabc&scaronin">
	<meta name="keywords" content="math, math&eacute;matiques, g&eacute;om&eacute;trie, &eacute;num&eacute;rative, Gen&egrave;ve">
	<meta name="description" content="Lukas Jakabcin's web page">
	<meta name="robots" content="all"><title>Lukas Jakabcin's web page</title>
	<!-- to correct the unsightly Flash of Unstyled Content. http://www.bluerobot.com/web/css/fouc.asp -->


	<script type="text/javascript"></script>

	<style type="text/css" media="all">
		@import "style.css";/*style  --  zengarden-sample*/
	</style>
<div id="container">
  <div id="pageHeader">
   <h1>Luk&aacute;&scaron; Jakab&ccaron;in</h1>
	 <h2>	Ma&icirc;tre de Conf&eacute;rences</h2>
<h2><span> LaM&eacute;, Universit&eacute; d'Orl&eacute;ans</span></h2>
  </div>
  <!--<div id="logo"><span><img src="logo_univ.png" width="150" height="80" border="0"></span></div>-->
  <div id="linkBox">
    <div id="linkList">
      <h3>Menu</h3>
      <ul>
        <li><a href="index.html">Accueil</a>&nbsp;</li>
        <li><a href="publications.html">Publications</a>&nbsp;</li>
        <li><a href="enseignement.html">Teaching</a>&nbsp;</li>
       <li><a href="talks.html">Talks</a>&nbsp;</li>
        <li><a href="cv.html">CV</a>&nbsp;</li>
      </ul>
    </div>
  </div>

  <div id="supportingText">
    <div id="corps">

      <h1>Journal articles</h1>
      <ol reversed>
	            <li>Cong Bang Trang, Luk&aacute;&scaron; Jakab&ccaron;in, Thomas Sayet, Eric Blond, Emmanuel de Bilbao, Athanasios Batakis, A percolation model for numerical simulations of 2D non-gravity impregnation in porous media, to appear in Journal of Computational Physics (JCP), 2024.
				<li>Martin J. Gander, Luk&aacute;&scaron; Jakab&ccaron;in, Michal Outrata, Domain truncation, absorbing boundary conditions, Schur complements, and Pad&eacute; approximation, Electronic Transactions on Numerical Analysis (ETNA), vol. 59, 319-341, 2023. HAL preprint: hal-03119569, January 2021.
				<li>Pierre Seppecher, Luk&aacute;&scaron; Jakab&ccaron;in,  Asymptotic comparison of the strain-gradient and micromorphic models when loading forces are widely spread. Theoretical Analyses, Computations and Experiments of Multiscale Materials. Springer, Cham, 253-272, 2022. HAL preprint: hal-03432329, November 2021.
				<li>Houssam Abdoul-Anziz, Luk&aacute;&scaron; Jakab&ccaron;in, Pierre Seppecher, Homogenization of an elastic material reinforced by very strong fibers arranged along a periodic lattice. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences (PRSA), Vol. 477(2246), 20200620, 2021. HAL preprint: hal-02482837, February 2020.  </li>
				<li>Luk&aacute;&scaron; Jakab&ccaron;in, Pierre Seppecher, On periodic homogenization of highly contrasted elastic structures, Journal of the Mechanics and Physics of Solids (JMPS), Vol. 144, 104104, 2020. HAL preprint: hal-02379572, November 2019.  </li>
              <li>Gr&eacute;goire Allaire, Luk&aacute;&scaron; Jakab&ccaron;in, Taking into account thermal residual stresses in topology optimization of structures built by additive manufacturing </a>,  Mathematical Models and Methods in Applied Sciences (M3AS), vol. 28 (12), 2313-2366, 2018. HAL preprint: hal-01666081, December 2017.  </li>
      <li>Luk&aacute;&scaron; Jakab&ccaron;in,<a href="https://www.esaim-m2an.org/articles/m2an/abs/2016/02/m2an141066/m2an141066.html"> Existence of solutions to an elasto-viscoplastic model with kinematic hardening and r-Laplacian fracture approximation</a>, Mathematical Modelling and Numerical Analysis (M2AN), vol.50, no.2, 455-473, 2016.</li>
	    <li>Luk&aacute;&scaron; Jakab&ccaron;in, <a href="https://www.esaim-cocv.org/articles/cocv/abs/2016/01/cocv150005/cocv150005.html"> A visco-elasto-plastic evolution model with regularized fracture</a>, Control, Optimisation and Calculus of Variations (COCV), vol. 22, no. 1., 148-168, 2016. </li>
	    <li>Eric Bonnetier, Luk&aacute;&scaron; Jakab&ccaron;in, St&eacute;phane Labb&eacute;, Anne Replumaz, <a href="paper_JCP.pdf">Numerical simulation of a class of models that combine several mechanisms of dissipation:
fracture, plasticity, viscous dissipation</a>, Journal of Computational Physics (JCP), 271</a>, 397-414, 2014.</li>
</ol>
<h1>Th&egrave;se de Doctorat (my PhD thesis)</h1>
<a href="These_Lukas_Jakabcin.pdf">Mod&eacute;lisation, analyse et simulation num&eacute;rique de solides combinant plasticit&eacute;, rupture et dissipation visqueuse</a>, Universit&eacute; J. Fourier, Grenoble, 2014.
<hr />
                <p align="right"> <!--Last update:
                  <!-- #BeginDate format:En2 12-Mars-2015<!-- #EndDate -->
                </p>
    </div>
  </div>
</div>

<div id="container">
  <div id="footer"></div>
</div>
